tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/completions"
tap "homebrew/core"
tap "homebrew/dupes"
tap "homebrew/services"
tap "homebrew/versions"
tap "mas-cli/tap"
tap "tldr-pages/tldr"
tap "tomanthony/brews"
brew "ack"
brew "ag"
brew "pcre"
brew "argtable"
brew "gettext"
brew "bat"
brew "confuse"
brew "bmon"
brew "boost"
brew "readline"
brew "gawk"
brew "dos2unix"
brew "findutils"
brew "c-ares"
brew "cabextract"
brew "libpng", args: ["universal"]
brew "freetype", args: ["universal"]
brew "fontconfig", args: ["universal"]
brew "coreutils"
brew "cryptopp"
brew "curl", args: ["with-libssh2", "with-openssl"]
brew "diff-so-fancy"
brew "doxygen"
brew "elasticsearch"
brew "fasd"
brew "ffmpeg"
brew "fping"
brew "fzf"
brew "jpeg", args: ["universal"]
brew "webp", args: ["universal"]
brew "gd", args: ["universal"]
brew "git-extras"
brew "gmp"
brew "libunistring"
brew "nettle"
brew "go"
brew "gobject-introspection"
brew "gperftools"
brew "libtool", args: ["universal"]
brew "graphicsmagick"
brew "lua"
brew "highlight"
brew "hiredis"
brew "htop"
brew "python"
brew "httpie"
brew "jasper", args: ["universal"]
brew "jnettop"
brew "oniguruma"
brew "jq"
brew "json-c"
brew "jsoncpp"
brew "lastpass-cli", args: ["with-pinentry"]
brew "less"
brew "snappy"
brew "leveldb"
brew "libev"
brew "libevent"
brew "libusb-compat", args: ["universal"]
brew "libgphoto2", args: ["universal"]
brew "libicns", args: ["universal"]
brew "libidn2"
brew "libmicrohttpd"
brew "libjson-rpc-cpp"
brew "libssh2"
brew "libuv"
brew "libwebsockets"
brew "libxml2"
brew "libzip"
brew "little-cms2", args: ["universal"]
brew "m-cli"
brew "makedepend"
brew "mas"
brew "miniupnpc"
brew "mongodb"
brew "mosquitto"
brew "mycli"
brew "mysql"
brew "ncdu"
brew "net-snmp"
brew "nethogs"
brew "nginx", restart_service: true
brew "nmap"
brew "openssl@1.1"
brew "p7zip"
brew "unixodbc"
brew "php@7.0"
brew "protobuf"
brew "redis", restart_service: true
brew "rethinkdb"
brew "sane-backends", args: ["universal"]
brew "sdl2"
brew "sox"
brew "ssh-copy-id"
brew "stow"
brew "tig"
brew "tree"
brew "wget"
brew "wifi-password"
brew "yarn"
brew "grep"
brew "yasm"
brew "ykpers"
brew "zeromq"
brew "zsh-syntax-highlighting"
brew "tldr-pages/tldr/tldr"
brew "tomanthony/brews/itermocil"
mas "Amphetamine", id: 937984704
mas "BetterSnapTool", id: 417375580
mas "NordVPN IKE", id: 1116599239
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "The Unarchiver", id: 425424353
mas "Twitter", id: 409789998
mas "Xcode", id: 497799835
mas "YubiKey Personalization Tool", id: 638161122
