tap "anomalyco/tap"
brew "ack"
brew "act"
brew "fontconfig"
brew "adwaita-icon-theme"
brew "agg"
brew "asciinema"
brew "asimov", restart_service: :changed
brew "autoenv"
brew "autojump"
brew "bat"
brew "dolt", restart_service: :changed
brew "beads"
brew "brew-cask-completion"
brew "brew-gem"
brew "openjdk"
brew "bundletool"
brew "chafa"
brew "cloudflared", restart_service: :changed
brew "coreutils"
brew "dive"
brew "eza"
brew "fd"
brew "findutils"
brew "fzf"
brew "gawk"
brew "ruby"
brew "gem-rake"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-flow"
brew "git-lfs"
brew "git-open"
brew "gnu-sed"
brew "go"
brew "graphviz"
brew "grep"
brew "gtk+3"
brew "gtksourceview4"
brew "node"
brew "gtop"
brew "hey"
brew "htop"
brew "hugo"
brew "imagemagick"
brew "imagesnap"
brew "jj"
brew "jq"
brew "k9s"
brew "kubectx"
brew "lazygit"
brew "lazyjj"
brew "lazyjournal"
brew "libomp"
brew "luarocks"
brew "mactop"
brew "make"
brew "mas"
brew "minikube"
brew "mintoolkit"
brew "mise"
brew "moreutils"
brew "navi"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "neovim"
# brew "nmap"
# brew "nvm"
# brew "nvtop"
# brew "ollama", restart_service: :changed, link: false
brew "ripgrep"
brew "opencode"
brew "podman"
brew "podman-compose"
brew "podman-tui"
# brew "portaudio"
# brew "postgresql@18", link: true
# brew "pyenv"
# brew "python-tk@3.13"
# brew "python@3.11"
# brew "reattach-to-user-namespace"
brew "sevenzip"
brew "shellcheck"
brew "stow"
# brew "subversion"
brew "syncthing", restart_service: :changed
brew "the_silver_searcher"
# brew "tldr"
brew "tmux"
brew "tree"
brew "ttyrec"
# brew "tuckr"
# brew "uni"
# brew "up"
brew "uv"
# brew "vim"
brew "xcodegen"
brew "yq"
# brew "zlib"
brew "zsh"
# cask "1password"
# cask "1password-cli"
# cask "aldente"
cask "alfred"
# cask "android-platform-tools"
cask "anki"
# cask "app-tamer"
# cask "bartender"
# cask "blender"
# cask "calibre"
# cask "cheetah3d"
cask "codex"
cask "copilot-cli"
# cask "coteditor"
# cask "cursor"
# cask "cursor-cli"
# cask "dash@6"
cask "deltawalker"
# cask "devonagent"
# cask "diffusionbee"
cask "discord"
# cask "docker-desktop"
# cask "dotnet-sdk"
# cask "drawio"
# cask "epic-games"
cask "font-jetbrains-mono-nerd-font"
cask "fork"
# cask "ganttproject"
cask "ghostty"
cask "github"
cask "gitup-app"
# cask "godot"
# cask "gog-galaxy"
# cask "google-chrome"
# cask "google-drive"
cask "handbrake-app"
cask "hex-fiend"
# cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "jetbrains-toolbox"
# cask "kiro"
# cask "ledger-wallet"
cask "little-snitch"
cask "lm-studio"
# cask "mem"
# cask "microsoft-auto-update"
# cask "microsoft-office"
cask "notion"
cask "notion-calendar"
cask "obsidian"
# cask "ollama-app"
# cask "paragon-ntfs"
# cask "plasticscm-cloud-edition"
cask "podman-desktop"
# cask "portfolioperformance"
cask "rectangle"
cask "screenflow"
cask "signal"
cask "slack"
cask "snagit"
cask "steam"
cask "syncthing-app"
cask "thebrain"
cask "thonny"
cask "unity-hub"
cask "virtualbox"
cask "vlc"
cask "warp"
cask "zed"
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer 2", id: 1616831348
mas "Affinity Photo 2", id: 1616822987
mas "Affinity Publisher 2", id: 1606941598
mas "Amphetamine", id: 937984704
mas "Compressor", id: 424390742
mas "DaisyDisk", id: 411643860
mas "Day One", id: 1055511498
# mas "DeathStranding", id: 6449748961
mas "Disk Diet", id: 445512770
mas "Draw Things", id: 6444050820
mas "Final Cut Pro", id: 424389933
mas "GarageBand", id: 682658836
mas "Gemini 2", id: 1090488118
mas "Goodnotes", id: 1444383602
mas "iA Writer", id: 775737590
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
# mas "Kindle", id: 302584613
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
# mas "Money", id: 1185488696
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Perplexity", id: 6714467650
mas "Pixelmator Pro", id: 1289583905
# mas "Pluralsight", id: 431748264
# mas "Resident Evil 4", id: 6462360082
# mas "RESIDENT EVIL 7 biohazard", id: 1640629241
mas "Save to Reader", id: 1640236961
mas "Scapple", id: 568020055
mas "Session Pal", id: 1515213004
# mas "Stockfish", id: 801463932
mas "Tailscale", id: 1475387142
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Toggl Track", id: 957734279
mas "Vinegar", id: 1591303229
mas "WhatsApp", id: 310633997
mas "WhisperNotes", id: 6447090616
mas "Xcode", id: 497799835
# uv "aider-chat"
# uv "codespeak-cli"
# uv "specify-cli"
