cask_args appdir: "/Applications"
tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "sambadevi/powerlevel9k"
brew "ack"
brew "openssl"
brew "argon2"
brew "aspell"
brew "autoconf"
brew "automake"
brew "bison"
brew "composer"
brew "coreutils"
brew "curl"
brew "libevent"
brew "libssh2"
brew "openldap"
brew "curl-openssl"
brew "diffutils"
brew "gmp"
brew "emacs"
brew "gettext"
brew "pcre"
brew "glib"
brew "enchant"
brew "exiftool"
brew "findutils"
brew "libpng"
brew "freetype"
brew "libtool"
brew "unixodbc"
brew "freetds"
brew "readline"
brew "gawk"
brew "jpeg"
brew "webp"
brew "gd"
brew "gdbm"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which", args: ["with-default-names"]
brew "go"
brew "sqlite"
brew "grc"
brew "grep"
brew "gzip"
brew "httpd", restart_service: true
brew "hub"
brew "icu4c"
brew "imagemagick"
brew "imap-uw"
brew "jp2a"
brew "jq"
brew "less"
brew "libgit2"
brew "libpq"
brew "libsodium"
brew "libxml2"
brew "libxslt"
brew "libzip"
brew "mas"
brew "mhash"
brew "mcrypt"
# brew "mysql-client"
brew "mysql@5.7", link: true
brew "nano"
brew "net-snmp"
brew "node"
brew "tidy-html5"
brew "php", restart_service: true
brew "pkg-config"
brew "postgresql"
brew "ruby-build"
brew "rbenv"
brew "re2c"
brew "redis", restart_service: true
brew "roundup"
brew "rsync"
brew "python"
brew "screen"
brew "smlnj"
brew "spaceman-diff"
brew "spark"
brew "ssh-copy-id"
brew "tree"
brew "unrar"
brew "watch"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-completions"
brew "puma/puma/puma-dev"
brew "sambadevi/powerlevel9k/powerlevel9k"
cask "1password"
cask "adium"
cask "alfred"
cask "angry-ip-scanner"
cask "atom"
cask "clamxav"
cask "dash"
cask "disk-inventory-x"
cask "docker"
cask "dropbox"
cask "epubquicklook"
cask "firefox"
cask "gas-mask"
cask "google-chrome"
cask "handbrake"
cask "iterm2"
cask "java"
cask "jumpcut"
cask "kitematic"
cask "lingon-x"
cask "meld"
# cask "mysqlworkbench"
cask "namechanger"
cask "path-finder"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "sequel-pro"
cask "skype"
cask "slack"
cask "spectacle"
cask "steam"
cask "suspicious-package"
cask "transmission"
cask "transmit"
cask "tunnelbear"
cask "vlc"
cask "webpquicklook"
cask "transmit"
cask "fluor"
mas "Evernote", id: 406056744
mas "Snapheal", id: 480623975
mas 'AJA System Test Lite', id: 1092006274
mas 'Disk Diag', id: 672206759
mas 'FX Photo Studio PRO', id: 432888949
mas 'Tonality', id: 892581529
mas 'Snapheal', id: 480623975
mas 'Intensify', id: 716854513
mas 'Evernote', id: 406056744
mas 'Caffeine', id: 411246225
mas 'fScanX-HE', id: 455685224
mas 'Decompressor', id: 1033480833
mas 'Dash', id: 449589707
mas 'Caato Time Tracker', id: 596816253
mas 'Caffeine', id: 411246225
mas 'Kindle', id: 405399194
mas 'Microsoft Remote Desktop', id: 715768417
mas 'Blackmagic Disk Speed Test', id: 425264550
